Revit 2024 API
BuiltInFailures.AssemblyFailures.IneligibleElementsInAssembly Property
 Ineligible elements in assembly.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId IneligibleElementsInAssembly { get; }
Visual Basic
Public Shared ReadOnly Property IneligibleElementsInAssembly As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ IneligibleElementsInAssembly {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.AssemblyFailures Class
Autodesk.Revit.DB Namespace